Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/include/pio/pic32ck2051sg01064.h
#define PIN_PC13N_PTC_DRV18                        _UINT32_(77)
#define MUX_PC13N_PTC_DRV18                        _UINT32_(13)
#define PINMUX_PC13N_PTC_DRV18                     ((PIN_PC13N_PTC_DRV18 << 16) | MUX_PC13N_PTC_DRV18)
#define PORT_PC13N_PTC_DRV18                       (_UINT32_(1) << 13)

#define PIN_PC09N_PTC_DRV19                        _UINT32_(73)
#define MUX_PC09N_PTC_DRV19                        _UINT32_(13)
#define PINMUX_PC09N_PTC_DRV19                     ((PIN_PC09N_PTC_DRV19 << 16) | MUX_PC09N_PTC_DRV19)
#define PORT_PC09N_PTC_DRV19                       (_UINT32_(1) << 9)

#define PIN_PC10N_PTC_DRV20                        _UINT32_(74)
#define MUX_PC10N_PTC_DRV20                        _UINT32_(13)
#define PINMUX_PC10N_PTC_DRV20                     ((PIN_PC10N_PTC_DRV20 << 16) | MUX_PC10N_PTC_DRV20)
#define PORT_PC10N_PTC_DRV20                       (_UINT32_(1) << 10)

#define PIN_PC11N_PTC_DRV21                        _UINT32_(75)
#define MUX_PC11N_PTC_DRV21                        _UINT32_(13)
#define PINMUX_PC11N_PTC_DRV21                     ((PIN_PC11N_PTC_DRV21 << 16) | MUX_PC11N_PTC_DRV21)
#define PORT_PC11N_PTC_DRV21                       (_UINT32_(1) << 11)

#define PIN_PC12N_PTC_DRV22                        _UINT32_(76)
#define MUX_PC12N_PTC_DRV22                        _UINT32_(13)
#define PINMUX_PC12N_PTC_DRV22                     ((PIN_PC12N_PTC_DRV22 << 16) | MUX_PC12N_PTC_DRV22)
#define PORT_PC12N_PTC_DRV22                       (_UINT32_(1) << 12)

/* ========== PORT definition for SDMMC0 peripheral ========== */
#define PIN_PA10I_SDMMC0_SDCD                      _UINT32_(10)
#define MUX_PA10I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA10I_SDMMC0_SDCD                   ((PIN_PA10I_SDMMC0_SDCD << 16) | MUX_PA10I_SDMMC0_SDCD)
#define PORT_PA10I_SDMMC0_SDCD                     (_UINT32_(1) << 10)

#define PIN_PA12I_SDMMC0_SDCD                      _UINT32_(12)
#define MUX_PA12I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PA12I_SDMMC0_SDCD                   ((PIN_PA12I_SDMMC0_SDCD << 16) | MUX_PA12I_SDMMC0_SDCD)
#define PORT_PA12I_SDMMC0_SDCD                     (_UINT32_(1) << 12)

#define PIN_PD10I_SDMMC0_SDCK                      _UINT32_(106)
#define MUX_PD10I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PD10I_SDMMC0_SDCK                   ((PIN_PD10I_SDMMC0_SDCK << 16) | MUX_PD10I_SDMMC0_SDCK)
#define PORT_PD10I_SDMMC0_SDCK                     (_UINT32_(1) << 10)

#define PIN_PD06I_SDMMC0_SDCMD                     _UINT32_(102)
#define MUX_PD06I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PD06I_SDMMC0_SDCMD                  ((PIN_PD06I_SDMMC0_SDCMD << 16) | MUX_PD06I_SDMMC0_SDCMD)
#define PORT_PD06I_SDMMC0_SDCMD                    (_UINT32_(1) << 6)

#define PIN_PD07I_SDMMC0_SDDAT0                    _UINT32_(103)
#define MUX_PD07I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PD07I_SDMMC0_SDDAT0                 ((PIN_PD07I_SDMMC0_SDDAT0 << 16) | MUX_PD07I_SDMMC0_SDDAT0)
#define PORT_PD07I_SDMMC0_SDDAT0                   (_UINT32_(1) << 7)

#define PIN_PD11I_SDMMC0_SDDAT1                    _UINT32_(107)
#define MUX_PD11I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PD11I_SDMMC0_SDDAT1                 ((PIN_PD11I_SDMMC0_SDDAT1 << 16) | MUX_PD11I_SDMMC0_SDDAT1)
#define PORT_PD11I_SDMMC0_SDDAT1                   (_UINT32_(1) << 11)

#define PIN_PD08I_SDMMC0_SDDAT2                    _UINT32_(104)
#define MUX_PD08I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PD08I_SDMMC0_SDDAT2                 ((PIN_PD08I_SDMMC0_SDDAT2 << 16) | MUX_PD08I_SDMMC0_SDDAT2)
#define PORT_PD08I_SDMMC0_SDDAT2                   (_UINT32_(1) << 8)

#define PIN_PD09I_SDMMC0_SDDAT3                    _UINT32_(105)
#define MUX_PD09I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PD09I_SDMMC0_SDDAT3                 ((PIN_PD09I_SDMMC0_SDDAT3 << 16) | MUX_PD09I_SDMMC0_SDDAT3)
#define PORT_PD09I_SDMMC0_SDDAT3                   (_UINT32_(1) << 9)

#define PIN_PB00I_SDMMC0_SDWP                      _UINT32_(32)
#define MUX_PB00I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PB00I_SDMMC0_SDWP                   ((PIN_PB00I_SDMMC0_SDWP << 16) | MUX_PB00I_SDMMC0_SDWP)
#define PORT_PB00I_SDMMC0_SDWP                     (_UINT32_(1) << 0)

#define PIN_PD05I_SDMMC0_SDWP                      _UINT32_(101)
#define MUX_PD05I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PD05I_SDMMC0_SDWP                   ((PIN_PD05I_SDMMC0_SDWP << 16) | MUX_PD05I_SDMMC0_SDWP)
#define PORT_PD05I_SDMMC0_SDWP                     (_UINT32_(1) << 5)

/* ========== PORT definition for SDMMC1 peripheral ========== */
#define PIN_PC04I_SDMMC1_SDCD                      _UINT32_(68)
#define MUX_PC04I_SDMMC1_SDCD                      _UINT32_(8) 
#define PINMUX_PC04I_SDMMC1_SDCD                   ((PIN_PC04I_SDMMC1_SDCD << 16) | MUX_PC04I_SDMMC1_SDCD)
#define PORT_PC04I_SDMMC1_SDCD                     (_UINT32_(1) << 4)

#define PIN_PC05I_SDMMC1_SDCK                      _UINT32_(69)
#define MUX_PC05I_SDMMC1_SDCK                      _UINT32_(8) 
#define PINMUX_PC05I_SDMMC1_SDCK                   ((PIN_PC05I_SDMMC1_SDCK << 16) | MUX_PC05I_SDMMC1_SDCK)
#define PORT_PC05I_SDMMC1_SDCK                     (_UINT32_(1) << 5)

#define PIN_PB07I_SDMMC1_SDCMD                     _UINT32_(39)
#define MUX_PB07I_SDMMC1_SDCMD                     _UINT32_(8) 
#define PINMUX_PB07I_SDMMC1_SDCMD                  ((PIN_PB07I_SDMMC1_SDCMD << 16) | MUX_PB07I_SDMMC1_SDCMD)
#define PORT_PB07I_SDMMC1_SDCMD                    (_UINT32_(1) << 7)

#define PIN_PB10I_SDMMC1_SDDAT0                    _UINT32_(42)
#define MUX_PB10I_SDMMC1_SDDAT0                    _UINT32_(8) 
#define PINMUX_PB10I_SDMMC1_SDDAT0                 ((PIN_PB10I_SDMMC1_SDDAT0 << 16) | MUX_PB10I_SDMMC1_SDDAT0)
#define PORT_PB10I_SDMMC1_SDDAT0                   (_UINT32_(1) << 10)

#define PIN_PC00I_SDMMC1_SDDAT1                    _UINT32_(64)
#define MUX_PC00I_SDMMC1_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC00I_SDMMC1_SDDAT1                 ((PIN_PC00I_SDMMC1_SDDAT1 << 16) | MUX_PC00I_SDMMC1_SDDAT1)
#define PORT_PC00I_SDMMC1_SDDAT1                   (_UINT32_(1) << 0)

